blog/2012/03/19/php-multi-thread/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>php multi-thread - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="php, multi-thread" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="as_sitesearch" value="guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>php multi-thread</h1>
  <p>
今天突然想看看PHP多线程的问题，发现很多人讲PHP的多线程其实是多进程，唉，破灭了！！！网上给PHP的模拟多线程提出了几种方案，下面仅摘录：
</p>

<blockquote>
<p>
  
There are a few solutions, varying from "Hmmm, just about OK" through to "Poke out your eyes".
</p>

<ol class="org-ol">
<li>Write your multithreaded code as a PHP extension. Probably the most supported, but you need to write in C (or another language supported for extensions).
</li>
<li>Spawn child processes onto the underlying OS, and read/write to their input/output with standard file handles. See popen for one route in, or PCNTRL. Reasonable, and you can use PHP from the command line.
</li>
<li>Make other HTTP requests to yourself via CURL or similar, thus piggybacking on your web servers multi-processing capacity. Keeps all your code "web like", but runs the risk of irate support developers tracking you down and breaking thumbs.
</li>
</ol>
</blockquote>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
